load-tests/video-chat.yml
config:
  target: "https://unitalks.gingr.chat"
  engines:
    socketio-v3: {}
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 3

    - name: "Ramp up"
      duration: 60
      arrivalRate: 3
      rampTo: 30

    - name: "Sustained"
      duration: 120
      arrivalRate: 30

    - name: "Spike"
      duration: 30
      arrivalRate: 100

  socketio-v3:
    transports: ["polling"]
    upgrade: false
    reconnection: false
    timeout: 20000
    rejectUnauthorized: false
    secure: true

  ensure:
    p99: 4000
    p95: 2000
    maxErrorRate: 5

scenarios:
  - name: "Video Chat User"
    engine: socketio-v3
    flow:
      - emit:
          channel: "joinQueue"
          data:
            mode: "video"

      - think: 2

      # SDP offer (larger payload for video)
      - emit:
          channel: "signal"
          data:
            type: "offer"
            sdp: "v=0\r\no=- 0 0 IN IP4 127.0.0.1\r\nm=video 9 UDP/TLS/RTP/SAVPF..."

      - think: 1

      # Multiple ICE candidates (realistic WebRTC behavior)
      - loop:
          - emit:
              channel: "signal"
              data:
                type: "candidate"
                candidate: "candidate:{{ $randomNumber(0,9) }} 1 UDP 2122252543 192.168.1.1 {{ $randomNumber(40000,60000) }} typ host"
          - think: 0.5
        count: 4

      # Simulate video call duration
      - think: 45

      - emit:
          channel: "leaveChat"
          data: {}